org/book-review:-genesis.org
#+hugo_base_dir: ../
#+date: <2019-06-01 Sat>
#+hugo_tags: books review biblical scifi
#+hugo_categories: books
#+TITLE: Book Review: Genesis

* Review
  A really underrated piece of science fiction with a lot of powerful ideas. The numerous biblical and historical references are beautifully interwoven and do not seem at all forced. Also contained within is an interesting perspective on AI safety combined with a re-imagining of original sin. 5 Stars.
