content/posts/book-review:-genesis.md
+++
title = "Book Review: Genesis"
author = ["Sreejith Pp"]
date = 2019-06-01T00:00:00+05:30
tags = ["books", "review", "biblical"]
categories = ["books"]
draft = false
+++

## Review {#review}

A really underrated piece of science fiction with a lot of powerful ideas. The numerous biblical and historical references are beautifully interwoven and do not seem at all forced. Also contained within is an interesting perspective on AI safety combined with a re-imagining of original sin. 5 Stars.
